org/explorations/service_account.org
#+TITLE: Conformance Tests hitting PodSpec.serviceAccount

* 10 Conformance Tests hitting PodSpec.serviceAccount

We noticed this in the summary for podspec_field_coverage.

#+NAME: Conformance Tests hitting PodSpec.serviceAccount
#+BEGIN_SRC sql-mode :exports both :eval never-export
select distinct test
from podspec_field_coverage
where podspec_field = 'serviceAccount'
and test like '%Conformance%';
#+END_SRC

#+RESULTS: Conformance Tests hitting PodSpec.serviceAccount
#+begin_src sql-mode
                                                      test                                                       
-----------------------------------------------------------------------------------------------------------------
  [k8s.io] Pods should allow activeDeadlineSeconds to be updated [NodeConformance] [Conformance]
  [k8s.io] Pods should be updated [NodeConformance] [Conformance]
  [sig-apps] ReplicaSet should adopt matching pods on creation and release no longer matching pods [Conformance]
  [sig-apps] ReplicationController should release no longer matching pods [Conformance]
  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]
  [sig-auth] ServiceAccounts should mount an API token into pods  [Conformance]
  [sig-storage] Downward API volume should update annotations on modification [NodeConformance] [Conformance]
  [sig-storage] Downward API volume should update labels on modification [NodeConformance] [Conformance]
  [sig-storage] Projected downwardAPI should update annotations on modification [NodeConformance] [Conformance]
  [sig-storage] Projected downwardAPI should update labels on modification [NodeConformance] [Conformance]
(10 rows)

#+end_src


* 18 Audit Log Entries for Conformance Test operations specifically hitting PodSpec.serviceAccount

We wanted to see exactly which conformance test + operations were specifically trying to set PodSpec.serviceAccount

#+NAME: 18 Conformance Test audit_events directly setting serviceAccount
#+BEGIN_SRC sql-mode :exports both :eval never-export
  select
      operation_id,
      split_part(audit_event.useragent, '--', 2) as test,
      CASE
      WHEN request_object->'spec'->'template'->'spec'->'serviceAccount' is not null
      THEN request_object->'spec'->'template'->'spec'->'serviceAccount'
      WHEN request_object->'template'->'spec'->'serviceAccount' is not null
      THEN request_object->'template'->'spec'->'serviceAccount'
      WHEN request_object->'spec'->'serviceAccount' is not null
      THEN request_object->'spec'->'serviceAccount'
      ELSE null
      END as service_account,
      CASE
      WHEN request_object->'spec'->'template'->'spec'->'serviceAccountName' is not null
      THEN request_object->'spec'->'template'->'spec'->'serviceAccountName'
      WHEN request_object->'template'->'spec'->'serviceAccountName' is not null
      THEN request_object->'template'->'spec'->'serviceAccountName'
      WHEN request_object->'spec'->'serviceAccountName' is not null
      THEN request_object->'spec'->'serviceAccountName'
      ELSE null
      END as service_account_name

  -- select count(*) from audit_event
  -- select count(*) from audit_event
  from audit_event
  where useragent like 'e2e%Conformance%'
  and (request_object->'spec'->'template'->'spec'->'serviceAccount' is not null
  or request_object->'template'->'spec'->'serviceAccount' is not null
  or request_object->'spec'->'serviceAccount' is not null)
  order by operation_id;
#+END_SRC

#+RESULTS: 18 Conformance Test audit_events directly setting serviceAccount
#+begin_src sql-mode
        operation_id        |                                                      test                                                       | service_account | service_account_name 
----------------------------+-----------------------------------------------------------------------------------------------------------------+-----------------+----------------------
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "default"       | "default"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should mount an API token into pods  [Conformance]                                  | "mount-test"    | "mount-test"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "default"       | "default"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "default"       | "default"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "mount"         | "mount"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "mount"         | "mount"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "nomount"       | "nomount"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "nomount"       | "nomount"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "mount"         | "mount"
 createCoreV1NamespacedPod  |  [sig-auth] ServiceAccounts should allow opting out of API token automount  [Conformance]                       | "nomount"       | "nomount"
 replaceCoreV1NamespacedPod |  [sig-apps] ReplicaSet should adopt matching pods on creation and release no longer matching pods [Conformance] | "default"       | "default"
 replaceCoreV1NamespacedPod |  [k8s.io] Pods should be updated [NodeConformance] [Conformance]                                                | "default"       | "default"
 replaceCoreV1NamespacedPod |  [sig-storage] Downward API volume should update annotations on modification [NodeConformance] [Conformance]    | "default"       | "default"
 replaceCoreV1NamespacedPod |  [sig-apps] ReplicationController should release no longer matching pods [Conformance]                          | "default"       | "default"
 replaceCoreV1NamespacedPod |  [sig-storage] Downward API volume should update labels on modification [NodeConformance] [Conformance]         | "default"       | "default"
 replaceCoreV1NamespacedPod |  [k8s.io] Pods should allow activeDeadlineSeconds to be updated [NodeConformance] [Conformance]                 | "default"       | "default"
 replaceCoreV1NamespacedPod |  [sig-storage] Projected downwardAPI should update annotations on modification [NodeConformance] [Conformance]  | "default"       | "default"
 replaceCoreV1NamespacedPod |  [sig-storage] Projected downwardAPI should update labels on modification [NodeConformance] [Conformance]       | "default"       | "default"
(18 rows)

#+end_src

